app/controllers/interns_controller.rb

SELECT * FROM "interns"
---
	def index
		@interns = Intern.all

SELECT * FROM "interns" WHERE ("interns"."id" = 1)
---
	def show
		@intern = Intern.find(params[:id])

INSERT INTO "interns" ("number", "created_at", "smell", "updated_at", "skills", "indentured_servant") VALUES(874892, '2009-04-02 05:55:51', 'Tolerable', '2009-04-02 05:55:51', 'stocking fridge, taking abuse', 'f')
---
	def create
		@intern = Intern.new(params[:intern])
		if @intern.save